<a href="https://colab.research.google.com/github/JakeOh/202105_itw_bd26/blob/main/lab_da/da08_read.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# 파일을 읽고 DataFrame 생성하기

* csv, tsv
* txt
* xls, xlsx
* ...

In [1]:
import pandas as pd

In [2]:
ex1_path = 'https://github.com/wesm/pydata-book/raw/2nd-edition/examples/ex1.csv'

In [3]:
ex1 = pd.read_csv(ex1_path)

In [4]:
ex1

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

`read_csv` 함수는 CSV 파일의 첫번째 줄을 데이터가 아니라 컬럼 이름으로 해석.

In [5]:
ex1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   a        3 non-null      int64
 1   b        3 non-null      int64
 2   c        3 non-null      int64
 3   d        3 non-null      int64
 4   message  3 non-null      object
dtypes: int64(4), object(1)
memory usage: 248.0+ bytes

`read_csv` 함수는 변수의 타입을 숫자로 변환할 수 있는 경우(문자열 -> 정수, 문자열 -> 실수)에 자동으로 변환함.

In [6]:
ex1_xlsx_path = 'https://github.com/wesm/pydata-book/raw/2nd-edition/examples/ex1.xlsx'

In [7]:
ex1_xlsx = pd.read_excel(ex1_xlsx_path)

In [8]:
ex1_xlsx

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [9]:
ex1_xlsx.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  3 non-null      int64
 1   a           3 non-null      int64
 2   b           3 non-null      int64
 3   c           3 non-null      int64
 4   d           3 non-null      int64
 5   message     3 non-null      object
dtypes: int64(5), object(1)
memory usage: 272.0+ bytes

`read_excel` 함수는 파일의 첫번째 row를 컬럼 이름으로 생각함.
파일의 첫번째 column을 행 번호(인덱스)로 간주하지는 않음.
만약 특정 컬럼이 데이터가 아니라 행 번호인 경우 index_col 파라미터를 사용해서 제거할 수 있음.

In [10]:
ex1_xlsx = pd.read_excel(ex1_xlsx_path, index_col=0)

In [11]:
ex1_xlsx

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [12]:
ex2_path = 'https://github.com/wesm/pydata-book/raw/2nd-edition/examples/ex2.csv'

첫번째 라인에 컬럼 이름이 없이 바로 데이터가 시작되는 CSV 파일

In [13]:
ex2 = pd.read_csv(ex2_path)

In [14]:
ex2  #> 파일의 첫번째 줄의 내용이 컬럼 이름이 되어 버림.

   1   2   3   4  hello
0  5   6   7   8  world
1  9  10  11  12    foo

In [18]:
ex2 = pd.read_csv(ex2_path, names=['a', 'b', 'c', 'd', 'message'])
ex2

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

* names 파라미터에 값이 전달되지 않는 경우, header 파라미터의 값은 0.
    * 파일의 첫번째 줄(0번 인덱스 라인)이 컬럼 이름(헤더)가 됨.
* names 파라미터에 값이 명시적으로 전달되는 경우, header 파라미터 값은 None.
    * 파일에서 header로 사용되는 줄이 없음.

In [19]:
# 값들이 공백('\s', '\t')으로 구분되어 있고, row/column label을 가지고 있는 파일
ex3_path = 'https://github.com/wesm/pydata-book/raw/2nd-edition/examples/ex3.txt'

In [20]:
ex3 = pd.read_csv(ex3_path, sep=r'\s+')
# r'\s+': 공백(space) 한개 이상을 의미하는 정규 표현식(regular expression)

In [21]:
ex3

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

`read_csv` 함수는 CSV 파일이나 TXT 파일에서 이름이 없는 컬럼은 row index(label)로 생각함.

In [22]:
ex3.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, aaa to ddd
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       4 non-null      float64
 1   B       4 non-null      float64
 2   C       4 non-null      float64
dtypes: float64(3)
memory usage: 288.0+ bytes

In [23]:
ex3.loc['aaa']

A   -0.264438
B   -1.026059
C   -0.619500
Name: aaa, dtype: float64

In [24]:
ex3.loc['aaa':'bbb']

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399

In [25]:
ex3.loc['aaa', 'A']

-0.264438

In [26]:
ex3.iloc[0, 0]

-0.264438

In [27]:
# 컬럼 이름과 데이터 이외에 파일에 대한 설명(주석)을 가지고 있는 CSV 파일
ex4_path = 'https://github.com/wesm/pydata-book/raw/2nd-edition/examples/ex4.csv'

In [28]:
ex4 = pd.read_csv(ex4_path, skiprows=[0, 2, 3])
#> skiprows: 생략할 행 번호들의 리스트, 또는 생략할 행의 개수(int)

In [29]:
ex4

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [30]:
# NA가 포함된 CSV 파일
ex5_path = 'https://github.com/wesm/pydata-book/raw/2nd-edition/examples/ex5.csv'

In [31]:
ex5 = pd.read_csv(ex5_path)

In [32]:
ex5

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

`read_csv` 함수는 CSV의 파일의 'NA', 'NAN', 'na', 'NaN' 등의 문자열을 Null(값이 없음)로 취급함. 실제로 비어 있는 값도 Null로 취급함.

In [33]:
ex5.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   something  3 non-null      object
 1   a          3 non-null      int64
 2   b          3 non-null      int64
 3   c          2 non-null      float64
 4   d          3 non-null      int64
 5   message    2 non-null      object
dtypes: float64(1), int64(3), object(2)
memory usage: 272.0+ bytes

In [34]:
# 값들이 따옴표("")로 감싸여져 있는 CSV 파일
ex7_path = 'https://github.com/wesm/pydata-book/raw/2nd-edition/examples/ex7.csv'

In [35]:
ex7 = pd.read_csv(ex7_path)

In [36]:
ex7

   a  b  c
0  1  2  3
1  1  2  3

따옴표 안의 문자열들이 숫자로 변환 가능한 경우에는 자동으로 타입 변환을 수행함.

In [37]:
ex7.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       2 non-null      int64
 1   b       2 non-null      int64
 2   c       2 non-null      int64
dtypes: int64(3)
memory usage: 176.0 bytes

* `pd.read_csv()` 함수: CSV 파일 -> DataFrame 생성
* `pd.DataFrame.to_csv()` 메서드: DataFrame -> CSV 파일 write

In [38]:
ex7.to_csv('ex7.csv')